product/load-test/results/scenario1-lock/before/run1/warmup.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /Users/ann/Programming/Java Projects/hub-eleven/product/load-test/scripts/scenario1-stock-decrease-lock.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 50s max duration (incl. graceful stop):
              * warmup: 10 looping VUs for 30s (gracefulStop: 20s)

time="2026-08-04T16:20:54+09:00" level=info msg="초기 재고: 100000000" source=console

running (01.0s), 10/10 VUs, 89 complete and 0 interrupted iterations
warmup   [   3% ] 10 VUs  00.9s/30s

running (02.0s), 10/10 VUs, 252 complete and 0 interrupted iterations
warmup   [   6% ] 10 VUs  01.9s/30s

running (03.0s), 10/10 VUs, 423 complete and 0 interrupted iterations
warmup   [  10% ] 10 VUs  02.9s/30s

running (04.0s), 10/10 VUs, 609 complete and 0 interrupted iterations
warmup   [  13% ] 10 VUs  03.9s/30s

running (05.0s), 10/10 VUs, 803 complete and 0 interrupted iterations
warmup   [  16% ] 10 VUs  04.9s/30s

running (06.0s), 10/10 VUs, 1037 complete and 0 interrupted iterations
warmup   [  20% ] 10 VUs  05.9s/30s

running (07.0s), 10/10 VUs, 1269 complete and 0 interrupted iterations
warmup   [  23% ] 10 VUs  06.9s/30s

running (08.0s), 10/10 VUs, 1509 complete and 0 interrupted iterations
warmup   [  26% ] 10 VUs  07.9s/30s

running (09.0s), 10/10 VUs, 1740 complete and 0 interrupted iterations
warmup   [  30% ] 10 VUs  08.9s/30s

running (10.0s), 10/10 VUs, 1977 complete and 0 interrupted iterations
warmup   [  33% ] 10 VUs  09.9s/30s

running (11.0s), 10/10 VUs, 2221 complete and 0 interrupted iterations
warmup   [  36% ] 10 VUs  10.9s/30s

running (12.0s), 10/10 VUs, 2456 complete and 0 interrupted iterations
warmup   [  40% ] 10 VUs  11.9s/30s

running (13.0s), 10/10 VUs, 2705 complete and 0 interrupted iterations
warmup   [  43% ] 10 VUs  12.9s/30s

running (14.0s), 10/10 VUs, 2965 complete and 0 interrupted iterations
warmup   [  46% ] 10 VUs  13.9s/30s

running (15.0s), 10/10 VUs, 3180 complete and 0 interrupted iterations
warmup   [  50% ] 10 VUs  14.9s/30s

running (16.0s), 10/10 VUs, 3427 complete and 0 interrupted iterations
warmup   [  53% ] 10 VUs  15.9s/30s

running (17.0s), 10/10 VUs, 3683 complete and 0 interrupted iterations
warmup   [  56% ] 10 VUs  16.9s/30s

running (18.0s), 10/10 VUs, 3941 complete and 0 interrupted iterations
warmup   [  60% ] 10 VUs  17.9s/30s

running (19.0s), 10/10 VUs, 4195 complete and 0 interrupted iterations
warmup   [  63% ] 10 VUs  18.9s/30s

running (20.0s), 10/10 VUs, 4451 complete and 0 interrupted iterations
warmup   [  66% ] 10 VUs  19.9s/30s

running (21.0s), 10/10 VUs, 4711 complete and 0 interrupted iterations
warmup   [  70% ] 10 VUs  20.9s/30s

running (22.0s), 10/10 VUs, 4971 complete and 0 interrupted iterations
warmup   [  73% ] 10 VUs  21.9s/30s

running (23.0s), 10/10 VUs, 5221 complete and 0 interrupted iterations
warmup   [  76% ] 10 VUs  22.9s/30s

running (24.0s), 10/10 VUs, 5474 complete and 0 interrupted iterations
warmup   [  80% ] 10 VUs  23.9s/30s

running (25.0s), 10/10 VUs, 5688 complete and 0 interrupted iterations
warmup   [  83% ] 10 VUs  24.9s/30s

running (26.0s), 10/10 VUs, 5912 complete and 0 interrupted iterations
warmup   [  86% ] 10 VUs  25.9s/30s

running (27.0s), 10/10 VUs, 6055 complete and 0 interrupted iterations
warmup   [  90% ] 10 VUs  26.9s/30s

running (28.0s), 10/10 VUs, 6229 complete and 0 interrupted iterations
warmup   [  93% ] 10 VUs  27.9s/30s

running (29.0s), 10/10 VUs, 6447 complete and 0 interrupted iterations
warmup   [  96% ] 10 VUs  28.9s/30s

running (30.0s), 10/10 VUs, 6677 complete and 0 interrupted iterations
warmup   [ 100% ] 10 VUs  29.9s/30s
time="2026-08-04T16:21:24+09:00" level=info msg="초기 재고: 100000000" source=console
time="2026-08-04T16:21:24+09:00" level=info msg="최종 재고: 99993288" source=console
time="2026-08-04T16:21:24+09:00" level=info msg="차감된 수량: 6712" source=console
time="2026-08-04T16:21:24+09:00" level=info msg="차감된 수량이 summary의 stock_decrease_successes count와 일치하는지 확인하세요" source=console


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate==0' rate=0.00%

    stock_unexpected_failures
    ✓ 'count==0' count=0


  █ TOTAL RESULTS 

    checks_total.......: 6712    222.432437/s
    checks_succeeded...: 100.00% 6712 out of 6712
    checks_failed......: 0.00%   0 out of 6712

    ✓ 차감 성공 또는 락 타임아웃

    CUSTOM
    stock_decrease_successes........: 6712   222.432437/s
    stock_lock_timeout_rate.........: 0.00%  0 out of 6712
    stock_unexpected_failure_rate...: 0.00%  0 out of 6712
    stock_unexpected_failures.......: 0      0/s

    HTTP
    http_req_duration...............: avg=44.58ms min=4.11ms med=40.18ms max=185.56ms p(90)=56.34ms p(95)=65.68ms p(99)=103.14ms
      { expected_response:true }....: avg=44.58ms min=4.11ms med=40.18ms max=185.56ms p(90)=56.34ms p(95)=65.68ms p(99)=103.14ms
    http_req_failed.................: 0.00%  0 out of 6714
    http_reqs.......................: 6714   222.498716/s

    EXECUTION
    iteration_duration..............: avg=44.71ms min=4.82ms med=40.31ms max=186.56ms p(90)=56.49ms p(95)=65.81ms p(99)=103.01ms
    iterations......................: 6712   222.432437/s
    vus.............................: 10     min=10        max=10
    vus_max.........................: 10     min=10        max=10

    NETWORK
    data_received...................: 4.0 MB 132 kB/s
    data_sent.......................: 1.3 MB 44 kB/s



running (30.2s), 00/10 VUs, 6712 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 10 VUs  30s